'''
Задание
1.	Сгенерируйте массив из целых чисел, содержащий 100 000 элементов, с помощью функции randomint из модуля random.

2.	Сгенерируйте с помощью функции range массив, содержащий словари со следующей структурой:

{
	“num_1”: randomint(1,1_000_000),
	“num_2”: randomint(1,1_000_000)
}

Длина массива должна составлять 100 000 элементов.

3.	Напишите функцию алгоритма сортировки пузырьком и с её помощью отсортируйте первый массив.

4.	Отсортируйте второй массив с помощью встроенного спиского метода .sort() и лямбда-функции сначала по первому ключу, потом по второму
'''