'''
Задание
Напишите класс SirotinskyAPI для взаимодействия с API, размещённым по адресу https://api.sirotinsky.com/.

Класс должен содержать в себе функционал для работы со всеми методами, указанными в документации к API, которые размещены по адресу https://api.sirotinsky.com/docs.

Метод инициализации экземпляра класса должен принимать в качестве аргументов логин и пароль для получения токена авторизации и сразу производить вызов приватного метода для получения токена в целях его сохранения как аргумента экземпляра.

Метод получения токена должен быть приватным и не доступен для вызова вне класса.

Методы для получения данных из ЕФРСБ должны быть публичными

Данные для доступа:
●	Логин: HSE_student
●	Пароль: 123123123
'''